Tekla Open API Reference for Tekla Structures 2025
DimensionBase.GetDimensionSet Method
Overload List
Name | Description
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
Top
See Also
Reference
DimensionBase Class
Tekla.Structures.Drawing Namespace